app/controllers/forum/forums_controller.rb

  def update_positions
    params[:forums_list].each_with_index do |id, index|
      Forum.update(id,:position => index)
---
UPDATE `forums` SET `updated_at` = '2009-04-29 11:56:17', `position` = 0 WHERE `id` = 5

  def create
    @forum = Forum.new params[:forum]
    respond_to do |wants|
      wants.html { }
      wants.js do
        render :update do |page|
          if @forum.save
---
INSERT INTO `forums` (`name`, `position`, `created_at`, `updated_at`, `description`) VALUES(NULL, NULL, '2009-04-29 09:59:42', '2009-04-29 09:59:42', NULL)

  def find_object
    if params[:id]
      @forum = Forum.find params[:id] , :include => :topics , :order => "forum_topics.created_at esc"
      @topics = @forum.topics.paginate(:all, :page => params[:page], :per_page => @per_page)
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.forum_id = NULL) ORDER BY created_at, updated_at desc LIMIT 1
SELECT * FROM `forums` WHERE (`forums`.`id` = 5)
SELECT max(`forums`.position) AS max_position FROM `forums`
SELECT * FROM `forum_topics` WHERE (`forum_topics`.forum_id = 5) ORDER BY updated_at desc LIMIT 0, 30
SELECT count(*) AS count_all FROM `forum_topics` WHERE (`forum_topics`.forum_id = 5)
SELECT count(`forums`.position) AS count_position FROM `forums`