app/controllers/forum/posts_controller.rb

SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 6)
INSERT INTO `forum_posts` (`forum_topic_id`, `created_at`, `body`, `updated_at`, `forum_user_profile_id`) VALUES(5, '2009-04-30 08:52:06', 'what are you laughing ?', '2009-04-30 08:52:06', 2)
---
  def create
    # raise
    @topic = ForumTopic.find params[:topic_id]
    @post = @topic.posts.build params[:forum_post]
    @post.profile = f_profile
    if @post.save