app/controllers/forum/topics_controller.rb

SELECT `forum_topics`.* FROM `forum_topics` WHERE (`forum_topics`.forum_id = 5) ORDER BY updated_at desc
INSERT INTO `forum_topics` (`created_at`, `title`, `updated_at`, `forum_id`, `type`, `forum_user_profile_id`) VALUES('2009-04-29 17:38:10', '很天真', '2009-04-29 17:38:10', 5, NULL, NULL)
---
  def create

    @topic = @forum.topics.build(params[:forum_topic])

    @topic.profile = @topic.posts.first.profile = f_profile


    respond_to do |wants|
      wants.html {   }
      wants.js do
        render :update do |page|
          if @topic.save