app/controllers/session_controller.rb

  def login
    redirect_back_or_default '/' and return if logged_in?
    @user = User.new
    return unless request.post?
    #handle authenticate
    if params[:user][:login] && params[:user][:login].size >0
---
SELECT * FROM `users` WHERE (`users`.`login` = 'cmsadmin') LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`salt`, `expires_at`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('b22ba1c2761fb2e66291caa49c774de6d4154234', NULL, '2009-04-29 08:43:54', '2f491a35b9ae58422ec9c69b407daf0a103cd40c', NULL, '2009-04-29 08:43:54', NULL, NULL, NULL)