app/controllers/cms/pages_controller.rb

  def create
    @page = @section.pages.build params[:page]
    if @page.save
---
INSERT INTO `pages` (`name`, `updated_by_id`, `position`, `created_at`, `title`, `updated_at`, `published`, `created_by_id`, `section_id`, `lock_version`, `archived`, `deleted`, `version`, `path`, `templet_id`, `hidden`) VALUES('11', NULL, NULL, '2009-04-30 11:45:08', '我愛羅', '2009-04-30 11:45:08', 0, NULL, 2, 0, 0, 0, NULL, '/p1/11', '1', NULL)