app/controllers/cms/sections_controller.rb

  def index
    @root = Section.first
---
SELECT * FROM `sections` WHERE (`sections`.parent_id = 1) ORDER BY position

  def new
    @parent = Section.find params[:parent_id]
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 6)

  def create
    @section = Section.new params[:section]
    if @section.save
---
INSERT INTO `sections` (`name`, `position`, `created_at`, `updated_at`, `is_url`, `path`, `parent_id`, `hidden`) VALUES('desire', 1, '2009-04-30 09:28:05', '2009-04-30 09:28:05', 0, '/p5/desire', 6, 0)