app/controllers/cms/templets_controller.rb

SELECT * FROM `templets`
---
  def index
    @templets = Templet.all

SELECT * FROM `templets` WHERE (`templets`.`id` = 1)
---
  def show
    @templet = Templet.find params[:id]

SELECT * FROM `templets` WHERE (`templets`.`id` = 1)
---
  def edit
    @templet = Templet.find params[:id]

SELECT * FROM `templets` WHERE (`templets`.`id` = 1)
UPDATE `templets` SET `content` = '<html>\r\n	<head><title>Test Templates</title></head>\r\n\r\n<body>\r\n 	<h1>Hello world</h1> \r\n	<p>Find my at layout/cms_templates/browser.html.erb</p>\r\n	<p>Created at April 26,2009 by xhan</p>\r\n<p>Updated at May 1 ,2009 by xhan</p>\r\n\r\n	<%= sticker_tag %>\r\n \r\n</body>\r\n\r\n</html>\r\n', `updated_at` = '2009-05-01 13:01:26' WHERE `id` = 1
---
  def update
   @templet = Templet.find params[:id]
   if @templet.update_attributes params[:templet]

SELECT * FROM `templets` WHERE (`templets`.`id` = 1)
---
  def republish
    @templet = Templet.find params[:id]